{
  "navigation_home": "Home",
  "navigation_welcome": "Welcome page",
  "signin": "Sign In",
  "signup": "Sign Up",
  "to_signin": "Login",
  "to_signup": "Register",
  "placeholder_fullName": "Display name",
  "placeholder_email": "E-mail",
  "placeholder_password": "Password",
  "placeholder_repeatPassword": "Repeat password",
  "formError_invalidEmail": "Incorrect email",
  "formError_invalidPassword": "Password must be at least 8 symbols and have at least one letter, one digit and one\nspecial character (@$!%*#?&)",
  "signup_account": "Already have an account? ",
  "login_account": "Don't have an account? ",
  "logout": "Sign Out",
  "now": " now",
  "changeLanguage": "Ru",
  "team_title": "Our team",
  "dzmitry_full": "Dmitry Luferov",
  "dzmitry_name": "Dmitry",
  "dzmitry_role": "Developer",
  "dzmitry_description": "Dima took on aspects of the project, including creating the header, footer, localization, and form validation. He monitored the cohesive interaction of all components and assessed the overall functionality of the application.",
  "ivan_full": "Ivan Nikanau",
  "ivan_name": "Ivan",
  "ivan_role": "Developer",
  "ivan_description": "Ivan utilized his development skills and implemented authentication through Firebase, ensuring the security of user data and creating a pleasant welcoming environment.",
  "vyacheslav_full": "Viacheslav Musiienko",
  "vyacheslav_name": "Viacheslav",
  "vyacheslav_role": "Team Lead, developer",
  "vyacheslav_description": "Slava focused on developing the GraphQL page, applying his deep knowledge and experience. He created a functional interface for working with queries and ensured efficient GraphQL interaction for our users.",
  "errorPage_title": "Sorry, this page is not available. You may have used an invalid link or the page has been removed.",
  "errorPage_button": "Back to welcome page",
  "selectSchema": "Select schema",
  "query": "Query",
  "res_section": "Response section",
  "var_section": "Variables section",
  "errorBoundary_title": "Something went wrong...",
  "errorBoundary_text": "Please try again later",
  "not_logged_in": "You are not logged in.",
  "welcome": "Welcome",
  "go_to_main": "Home",
  "promo_header": "What this project about?",
  "promo_subheader": "The GraphiQL project is a sandbox for working with GraphQL queries, created by a team of three developers. The application allows users to interactively edit queries, variables, and headers, as well as create and save an account for future use. It includes functionality for viewing documentation and receiving instant responses to queries.",
  "course_title": "What is the RSSchool React course about and why should you choose it?",
  "course_description": "This educational program from RS School is suitable for students who have completed the second stage of the JavaScript course, as well as individuals with practical experience and knowledge in JavaScript, TypeScript, CSS3, and HTML5. The training is free, conducted online in English, and focused on practical application. During the course, students will learn React, its ecosystem, and go through all stages of modern development, including independent task completion, code reviews of other participants' work, writing tests, collaborating with mentors, and developing a final project in a team. Advice from mentors and fellow students can be obtained through the Discord chat, and participants who successfully complete the course will receive electronic certificates.",
  "signInError_email": "Email is required",
  "signInError_password": "Password is required",
  "signUpError_name": "Name is required",
  "signUpError_name_length": "Display name should have at least 2 letters",
  "signUpError_name_pattern": "Display name should consist only from letters",
  "signUpError_email": "Email is required",
  "signUpError_email_pattern": "The email you entered is invalid. Please check the input for accuracy",
  "signUpError_password": "Password is required",
  "signUpError_password_length": "Password length should be at least 8 symbols",
  "signUpError_password_pattern": "Should have at least 1 uppercase symbol, 1 lowercase symbol, 1 number and 1 special character - @$!%*#?&",
  "signUpError_repeatPassword": "Passwords doesn't match or filed is empty",
  "serverError_inUse": "This email already exists",
  "serverError_invalidEmail": "The email you entered is invalid. Please check the input for accuracy",
  "serverError_manyRequests": "Too many requests. Try again later",
  "serverError_notFound": "The email address you entered is not associated with any account",
  "serverError_wrongPassword": "The password is invalid for the given email",
  "serverError_missingPassword": "Missing the password",
  "serverError_userDisabled": "The user corresponding to the given email has been disabled",
  "selectSchema": "Select schema"
}
